EDT/УТ/src/Documents/НачислениеЗатрат/НачислениеЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗатрат</name>
  <registerRecords>AccumulationRegister.НачислениеЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.НачислениеДоходов</registerRecords>
  <tabularSections>
    <name>ПрямыеЗатраты</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗатрат</name>
      <type>
        <types>EnumRef.ТипыЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределяемыеЗатраты</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗатрат</name>
      <type>
        <types>EnumRef.ТипыЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоходыКомпании</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределенныеЗатраты</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДоставки</name>
      <type>
        <types>CatalogRef.КатегорииДоставки2014</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗатрат</name>
      <type>
        <types>EnumRef.ТипыЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СведенияОДоходахКомпании/СведенияОДоходахКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОДоходахКомпании</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Юрлицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ВводДанныхОРасходахКомпании/ВводДанныхОРасходахКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВводДанныхОРасходахКомпании</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Юрлицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗатрат</name>
    <type>
      <types>EnumRef.ВидыЗатратКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗатрат</name>
    <type>
      <types>EnumRef.ТипыЗатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ВидыЗатратКомпании/ВидыЗатратКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗатратКомпании</name>
  <enumValues>
    <name>ПрямыеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РаспределяемыеРасходы</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/НачислениеЗатрат/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьДокумент(ОчиститьТЧ)
	
	Дата                  = Объект.Дата;
	ДоходыКомпании        = Объект.ДоходыКомпании;
	ПрямыеЗатраты         = Объект.ПрямыеЗатраты;
	РаспределяемыеЗатраты = Объект.РаспределяемыеЗатраты;
	
	Если ОчиститьТЧ Тогда
		ДоходыКомпании.Очистить();
		ПрямыеЗатраты.Очистить();
		РаспределяемыеЗатраты.Очистить();
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	СведенияОДоходахКомпании.Партнер,
	            |	СведенияОДоходахКомпании.СтатьяДоходов,
	            |	СведенияОДоходахКомпании.КатегорияДоставки,
	            |	СведенияОДоходахКомпании.ТипЗаказа,
	            |	СУММА(СведенияОДоходахКомпании.Сумма) КАК Сумма
	            |ИЗ
	            |	РегистрСведений.СведенияОДоходахКомпании КАК СведенияОДоходахКомпании
	            |ГДЕ
	            |	СведенияОДоходахКомпании.Период МЕЖДУ &НачПериода И &КонПериода
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	СведенияОДоходахКомпании.Партнер,
	            |	СведенияОДоходахКомпании.СтатьяДоходов,
	            |	СведенияОДоходахКомпании.КатегорияДоставки,
	            |	СведенияОДоходахКомпании.ТипЗаказа";
	Зап.УстановитьПараметр("НачПериода", НачалоМесяца(Дата));			
	Зап.УстановитьПараметр("КонПериода", КонецМесяца(Дата));			
	
	ВыбДоходы = Зап.Выполнить().Выгрузить();
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипЗаказа", Перечисления.ТипыЗаказов.Фрахт);
	НайденныеСтроки = ВыбДоходы.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрФрахт Из НайденныеСтроки Цикл
		СтрФрахт.КатегорияДоставки = Справочники.КатегорииДоставки2014.КГТ2;
	КонецЦикла;	
	//Выб = зап.Выполнить().Выбрать();
	//Пока Выб.Следующий() Цикл
	Для Каждого Стр Из ВыбДоходы Цикл
		Нов = ДоходыКомпании.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Стр);
	КонецЦикла;	
	
	Зап = Новый Запрос;
	Зап.Текст = 
	"ВЫБРАТЬ
	|	ВводДанныхОРасходахКомпании.Партнер,
	|	ВводДанныхОРасходахКомпании.КатегорияДоставки,
	|	ВводДанныхОРасходахКомпании.ТипЗаказа,
	|	СУММА(ВводДанныхОРасходахКомпании.Сумма) КАК Сумма,
	|	ВводДанныхОРасходахКомпании.СтатьяЗатрат,
	|	ВводДанныхОРасходахКомпании.СтатьяЗатрат.ТипЗатрат,
	|	ВводДанныхОРасходахКомпании.ТипЗатрат
	|ИЗ
	|	РегистрСведений.ВводДанныхОРасходахКомпании КАК ВводДанныхОРасходахКомпании
	|ГДЕ
	|	ВводДанныхОРасходахКомпании.Период МЕЖДУ &НачПериода И &КонПериода
	|	И ВводДанныхОРасходахКомпании.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатратКомпании.ПрямыеРасходы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводДанныхОРасходахКомпании.Партнер,
	|	ВводДанныхОРасходахКомпании.КатегорияДоставки,
	|	ВводДанныхОРасходахКомпании.ТипЗаказа,
	|	ВводДанныхОРасходахКомпании.СтатьяЗатрат,
	|	ВводДанныхОРасходахКомпании.СтатьяЗатрат.ТипЗатрат,
	|	ВводДанныхОРасходахКомпании.ТипЗатрат";
	Зап.УстановитьПараметр("НачПериода", НачалоМесяца(Дата));			
	Зап.УстановитьПараметр("КонПериода", КонецМесяца(Дата));			
	
	ВыбПрямыеЗатраты = Зап.Выполнить().Выгрузить();
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипЗаказа", Перечисления.ТипыЗаказов.Фрахт);
	НайденныеСтроки = ВыбПрямыеЗатраты.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрФрахт Из НайденныеСтроки Цикл
		СтрФрахт.КатегорияДоставки = Справочники.КатегорииДоставки2014.КГТ2;
	КонецЦикла;	
	//Выб = зап.Выполнить().Выбрать();
	//Пока Выб.Следующий() Цикл
	Для Каждого Стр Из ВыбПрямыеЗатраты Цикл
		Нов = ПрямыеЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Стр);
	КонецЦикла;	
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	СУММА(ВводДанныхОРасходахКомпании.Сумма) КАК Сумма,
	            |	ВводДанныхОРасходахКомпании.СтатьяЗатрат,
	            |	ВводДанныхОРасходахКомпании.ТипЗатрат
	            |ИЗ
	            |	РегистрСведений.ВводДанныхОРасходахКомпании КАК ВводДанныхОРасходахКомпании
	            |ГДЕ
	            |	ВводДанныхОРасходахКомпании.Период МЕЖДУ &НачПериода И &КонПериода
	            |	И ВводДанныхОРасходахКомпании.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатратКомпании.РаспределяемыеРасходы)
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ВводДанныхОРасходахКомпании.Партнер,
	            |	ВводДанныхОРасходахКомпании.КатегорияДоставки,
	            |	ВводДанныхОРасходахКомпании.ТипЗаказа,
	            |	ВводДанныхОРасходахКомпании.СтатьяЗатрат,
	            |	ВводДанныхОРасходахКомпании.ТипЗатрат";
	Зап.УстановитьПараметр("НачПериода", НачалоМесяца(Дата));			
	Зап.УстановитьПараметр("КонПериода", КонецМесяца(Дата));			
	
	Выб = зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Нов = РаспределяемыеЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Выб);
	КонецЦикла;	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьДок(Команда)
	
	Если    Объект.ДоходыКомпании.Количество()        > 0 
		ИЛИ Объект.ПрямыеЗатраты.Количество()         > 0
		ИЛИ Объект.РаспределяемыеЗатраты.Количество() > 0 Тогда
		
		ВопросПользователю = Вопрос(
		"Очистить табличные части документа перед заполнением?",
		РежимДиалогаВопрос.ДаНетОтмена,
		0, // таймаут в секундах
		КодВозвратаДиалога.Нет, // (необ.) кнопка по умолчанию
		"Заполнение документа"); // (необ.) заголовок
		
		Если ВопросПользователю = КодВозвратаДиалога.Да Тогда
			ЗаполнитьДокумент(Истина);
		ИначеЕсли ВопросПользователю = КодВозвратаДиалога.Нет Тогда
			ЗаполнитьДокумент(Ложь);
		Иначе 
			Возврат;
		КонецЕсли;
	Иначе
		ЗаполнитьДокумент(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспределенныеЗатратыНаСервере()
	
	ДоходыКомпании        = Объект.ДоходыКомпании;
	//ПрямыеЗатраты         = Объект.ПрямыеЗатраты;
	РаспределяемыеЗатраты = Объект.РаспределяемыеЗатраты;
	РаспределенныеЗатраты = Объект.РаспределенныеЗатраты;
	
	РаспределенныеЗатраты.Очистить();
	
	ТЗДоходы = ДоходыКомпании.Выгрузить();
	ТЗДоходы.Свернуть("Партнер, СтатьяДоходов, КатегорияДоставки, ТипЗаказа,", "Сумма");
	ИтогоДоходы = ТЗДоходы.Итог("Сумма");
	
	Для Каждого СтрЗатрат Из РаспределяемыеЗатраты Цикл
		//СтрЗатрат.СтатьяЗатрат;
		//СтрЗатрат.Сумма
		
		Для Каждого СтрДохода Из ТЗДоходы Цикл
			
			ПрПартнера       = СтрДохода.Сумма / ИтогоДоходы;
			СуммаРаспрЗатрат = Окр(СтрЗатрат.Сумма * ПрПартнера,2);
			
			Если СуммаРаспрЗатрат > 0 Тогда
				
				НоваяСтрРаспределенныхЗатрат = РаспределенныеЗатраты.Добавить();
				
				НоваяСтрРаспределенныхЗатрат.СтатьяЗатрат = СтрЗатрат.СтатьяЗатрат;
				НоваяСтрРаспределенныхЗатрат.ТипЗатрат    = СтрЗатрат.ТипЗатрат;
				
				НоваяСтрРаспределенныхЗатрат.Партнер           = СтрДохода.Партнер;
				НоваяСтрРаспределенныхЗатрат.КатегорияДоставки = СтрДохода.КатегорияДоставки;
				НоваяСтрРаспределенныхЗатрат.ТипЗаказа         = СтрДохода.ТипЗаказа;
				НоваяСтрРаспределенныхЗатрат.Сумма             = СуммаРаспрЗатрат;
				
			КонецЕсли;
			
		КонецЦикла;
		
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаспределенныеЗатраты(Команда)
	
	ЗаполнитьРаспределенныеЗатратыНаСервере();	
	
КонецПроцедуры
